import great_expectations as gx
import pandas as pd


# считываем данные
df = pd.read_csv('titanic.csv')
df.head()

# выводим в качестве проверки:
# список типов данных
print(df.dtypes)

# количество занятых мест по каютам
print(df['Cabin'])

# Первое, что бросается в глаза, это наличие значений NaN (это отсутствие какого-либо значения) в колонке Cabin.
# Это плохо и работать с такими данными не очень бы хотелось. Поэтому мы проверим наш датафрейм и
# воспользуемся библиотекой Great Expectations.


# создаем объект датафрейма GE (библиотека ожиданий)
df_ge = gx.from_pandas(df)
df_ge.head()